;*****************************************************************************;
;            Language set file for plugins used by NativeLang.dll             ;
;*****************************************************************************;
;                                                                             ;
; Please change the file and distribute to the corresponding developer.       ;
;                                                                             ;
;*****************************************************************************;


; Explorer Language Set ******************************** jens.plugin.npp@gmx.de
[Explorer.dll NppMenu]
Main="&Explorer"
0="&Explorer...%tStrg+Shift+Alt+E"
1="&Favorites...%tStrg+Shift+Alt+F"
3="Explorer &Options..."
5="&Help..."

[Explorer.dll Explorer]
30505="Filter:"
30506="Filter:"

[Explorer.dll ContextMenu]
10000="New File..."
10001="New Folder..."
10002="Find in Files..."
10003="Open"
10004="Open in Other View"
10005="Open in New Instance"
10006="DOS Prompt..."
10007="Add to 'Favorites'..."
10008="Full File Path(s) to Document"
10009="File Name(s) to Document"

[Explorer.dll New]
2="Cancel"

[Explorer.dll FileList]
Name="Name"
Ext.="Ext."
Size="Size"
Date="Date"

[Explorer.dll Favorites]

[Explorer.dll FavProp]
Caption="Favorites"
2="Cancel"
30618="Name:"
30619="Link:"
30615="Select a group"

[Explorer.dll FavMenu]
1="New Link..."
2="New Group..."
3="Add existing Session..."
4="Save Current Session"
5="Copy"
6="Cut"
7="Paste"
8="Delete"
9="Properties..."
10="Open"
11="Open in Other View"
12="Open in New Instance"
13="Reopen"

[Explorer.dll Options]
Caption="Explorer Options"
30651="&Folder With Braces"
30652="Automatic &Update on Focus"
30656="Separate &Extensions"
30657="Show &Hidden Files"
30658="      &View 'Long' List"
30659="Use Windows &Icons"
30661="Size:"
30662="Date:"
30663="File List"
30664="General Options"
30665="Timeout Missed Drives (ms):"

[Explorer.dll ComboSize]
0="Bytes"
1="kBytes"
2="Dynamic x b/k/M"
3="Dynamic x,x b/k/M"

[Explorer.dll ComboDate]
0="Y/M/D HH:MM"
1="D.M.Y HH:MM"

[Explorer.dll Help]
Caption="Help"
30703="Author:"
30704="eMail:"
30705="At first, I would like to thank Don for his great program and his support to create this plugin."
30706="Menu entries"
30707="Explorer...%t%tViews the Explorer dialog."
30708="Favorites...%t%tViews the Favorites dialog."
30709="Options...%t%tAllows you to personalize the\n\t\t\tsettings for explorers file list."
30710="Help...%t%t%tShows this help dialog."

[Explorer.dll Text]
Explorer="Explorer"
Favorites="Favorites"
Previous Folder="Previous Folder"
Next Folder="Next Folder"
New File...="New File..."
New Folder...="New Folder..."
Find in Files...="Find in Files..."
Folder of Current File="Folder of Current File"
User Folder="User Folder"
Refresh="Refresh"
Link Current File...="Link Current File..."
Link Current Folder...="Link Current Folder..."
New Link...="New Link..."
Delete Link="Delete Link"
Edit Link...="Edit Link..."
New file="New file"
New folder="New folder"
Properties="Properties"
Details="Details %%s"
New element in="New element in %%s"
New group in="New group in %%s"
Save current Session="Save current Session"
Add existing Session="Add existing Session"
Standard Menu="Standard Menu"
